Andy-Cheng1017/ChargeStation/NUC121_NUC125_Series_BSP_CMSIS_V3.01.007/SampleCode/NuTiny-SDK-NUC121_125/LED_Toggle/main.c
//                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
//                break;
//
//            case 0x48:                                                      /* Slave Address NACK */
//                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
//                u8Err = 1;
//                break;
//
//            case 0x58:
//                u8rData = (unsigned char) I2C_GET_DATA(i2c);                  /* Receive Data */
//                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
//                u8Xfering = 0;
//                break;
//
//            case 0x38:                                                      /* Arbitration Lost */
//            default:                                                        /* Unknow status */
//                I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);      /* Clear SI and send STOP */
//                u8Ctrl = I2C_CTL_SI;                                  /* Clear SI and send STOP */
//                u8Err = 1;
//                break;
//        }
//
//        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                   /* Write controlbit to I2C_CTL register */
//    }
//
//    if (u8Err)
//        u8rData = 0;                                                          /* If occurs error, return 0 */
//
//    return u8rData;                                                           /* Return read data */
//}
//
///**
//  * @brief      Specify two bytes register address and read multi bytes from Slave
//  *
//  * @param[in]  *i2c            Point to I2C peripheral
//  * @param[in]  u8SlaveAddr     Access Slave address(7-bit)
//  * @param[in]  u16DataAddr     Specify a address (2 bytes) of data read from
//  * @param[out] *pu8rData       Point to array to store data from Slave
//  * @param[in]  u32rLen         How many bytes need to read from Slave
//  *
//  * @return     A length of how many bytes have been received
//  *
//  * @details    The function is used for I2C Master specify two bytes address that multi data bytes read from Slave.
//  *             If transmission timeout, the g_I2C_i32ErrCode will be set to I2C_TIMEOUT_ERR.
//  *
//  *
//  */
//uint32_t I2C_ReadMultiBytesTwoRegs(I2C_T *i2c, uint8_t u8SlaveAddr, uint16_t u16DataAddr, uint8_t *pu8rData, uint32_t u32rLen)
//{
//    uint8_t u8Xfering = 1, u8Err = 0, u8Addr = 1, u8Ctrl = 0;
//    uint32_t u32rxLen = 0;
//
//    g_I2C_i32ErrCode = 0;
//    I2C_START(i2c);                                                         /* Send START */
//
//    while (u8Xfering && (u8Err == 0))
//    {
//        uint32_t u32TimeOutCount = SystemCoreClock; // 1 second timeout
//        I2C_WAIT_READY(i2c)
//        {
//            u32TimeOutCount--;
//
//            if (u32TimeOutCount == 0)
//            {
//                g_I2C_i32ErrCode = I2C_TIMEOUT_ERR;
//                break;
//            }
//        }
//
//        switch (I2C_GET_STATUS(i2c))
//        {
//            case 0x08:
//                I2C_SET_DATA(i2c, (u8SlaveAddr << 1 | 0x00));               /* Write SLA+W to Register I2CDAT */
//                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
//                break;
//
//            case 0x18:                                                      /* Slave Address ACK */
//                I2C_SET_DATA(i2c, (uint8_t)((u16DataAddr & 0xFF00) >> 8));    /* Write Hi byte address of register */
//                break;
//
//            case 0x20:                                                      /* Slave Address NACK */
//            case 0x30:                                                      /* Master transmit data NACK */
//                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
//                u8Err = 1;
//                break;
//
//            case 0x28:
//                if (u8Addr)
//                {
//                    I2C_SET_DATA(i2c, (uint8_t)(u16DataAddr & 0xFF));       /* Write Lo byte address of register */
//                    u8Addr = 0;
//                }
//                else
//                    u8Ctrl = I2C_CTL_STA_SI;                              /* Clear SI and send repeat START */
//
//                break;
//
//            case 0x10:
//                I2C_SET_DATA(i2c, ((u8SlaveAddr << 1) | 0x01));             /* Write SLA+R to Register I2CDAT */
//                u8Ctrl = I2C_CTL_SI;                                      /* Clear SI */
//                break;
//
//            case 0x40:                                                      /* Slave Address ACK */
//                u8Ctrl = I2C_CTL_SI_AA;                                   /* Clear SI and set ACK */
//                break;
//
//            case 0x48:                                                      /* Slave Address NACK */
//                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
//                u8Err = 1;
//                break;
//
//            case 0x50:
//                pu8rData[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);      /* Receive Data */
//
//                if (u32rxLen < (u32rLen - 1))
//                    u8Ctrl = I2C_CTL_SI_AA;                               /* Clear SI and set ACK */
//                else
//                    u8Ctrl = I2C_CTL_SI;                                  /* Clear SI */
//
//                break;
//
//            case 0x58:
//                pu8rData[u32rxLen++] = (unsigned char) I2C_GET_DATA(i2c);      /* Receive Data */
//                u8Ctrl = I2C_CTL_STO_SI;                                  /* Clear SI and send STOP */
//                u8Xfering = 0;
//                break;
//
//            case 0x38:                                                      /* Arbitration Lost */
//            default:                                                        /* Unknow status */
//                I2C_SET_CONTROL_REG(i2c, I2C_CTL_STO_SI);      /* Clear SI and send STOP */
//                u8Ctrl = I2C_CTL_SI;                                  /* Clear SI and send STOP */
//                u8Err = 1;
//                break;
//        }
//
//        I2C_SET_CONTROL_REG(i2c, u8Ctrl);                                   /* Write controlbit to I2C_CTL register */
//    }
//
//    return u32rxLen;                                                        /* Return bytes length that have been received */
//}
//
///*@}*/ /* end of group I2C_EXPORTED_FUNCTIONS */
//
///*@}*/ /* end of group I2C_Driver */
//
///*@}*/ /* end of group Standard_Driver */
//
///*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/

